# MySQL Quickstart Notebook

Esta libreta demuestra cómo conectarse a la base de datos MySQL creada en tu **docker‑compose** y realizar operaciones básicas usando **SQLAlchemy** y **pandas**. Los datos iniciales se han cargado desde el *seed* `01-books.sql`, que crea una tabla `books`.

➡️ **Objetivos**
1. Listar tablas existentes.
2. Leer datos a un `DataFrame`.
3. Ejecutar consultas SQL sencillas.
4. Ejercicio: obtener los 5 libros más caros (con solución al final).

---
**Credenciales** (definidas en `compose.yaml`):
- host: **`mysql`**  (dentro de la red Docker)
- usuario: **`example_user`**
- contraseña: **`example_password`**
- base de datos: **`example_db`**

In [9]:
import pandas as pd
from sqlalchemy import create_engine, text
from sqlalchemy.orm import Session

engine = create_engine(
    # "mysql+pymysql://example_user:example_password@mysql:3306/example_db",
    "mysql+pymysql://example_user:example_password@127.0.0.1:3306/books_db",

    pool_pre_ping=True,
)
print('✅ Conexión creada')

✅ Conexión creada

### Listar tablas existentes

In [3]:
with engine.connect() as conn:
    result = conn.execute(text("SHOW TABLES"))
    for row in result:
        print(row[0])

authors
books
books_genres
genres

### Cargar tabla `books` a un DataFrame

In [4]:
books_df = pd.read_sql("SELECT * FROM books", engine)
books_df.head()

   id             title  author_id  pages  year  price
0   1        Clean Code          1    464  2008   35.5
1   2     Fluent Python          2   1014  2015   42.0
2   3     Python Tricks          3    302  2017   25.0
3   4  Effective Python          4    256  2015   30.0
4   5      Learning SQL          5    350  2009   22.5

### Precio medio de los libros

In [5]:
avg_price = pd.read_sql("SELECT AVG(price) AS avg_price FROM books", engine)
avg_price

   avg_price
0  28.832222

## Ejercicio 1: Top 5 libros más caros
Obtener el título y precio de los 5 libros más caros.

In [6]:
# ✅ Tu solución aquí
top5_df = pd.read_sql("""
SELECT title, price
FROM books
ORDER BY price DESC
LIMIT 5
""", engine)
top5_df

                      title  price
0             Fluent Python   42.0
1  The Pragmatic Programmer   40.0
2                Clean Code   35.5
3          Effective Python   30.0
4             Python Tricks   25.0

### Consulta parametrizada (libros por autor)

In [7]:
author = 'J.K. Rowling'
query = text("""
SELECT title, year
FROM books
JOIN authors ON books.author_id = authors.id
WHERE authors.name = :a
ORDER BY year
""")

author_books = pd.read_sql(query.bindparams(a=author), engine)
author_books

                                     title  year
0       Harry Potter y la piedra filosofal  1997
1        Harry Potter y la cÃ¡mara secreta  1998
2  Harry Potter y el prisionero de Azkaban  1999

## Ejercicio 2: Número de libros por autor
Obtener el número de libros que tiene cada autor.

In [11]:
# ✅ Solución
df_autores = pd.read_sql("""
SELECT authors.name AS autor, COUNT(books.id) AS num_libros
FROM books
JOIN authors ON books.author_id = authors.id
GROUP BY authors.name
ORDER BY num_libros DESC
""", engine)
df_autores

              autor  num_libros
0      J.K. Rowling           3
1  Robert C. Martin           1
2   Luciano Ramalho           1
3         Dan Bader           1
4     Brett Slatkin           1
5     Alan Beaulieu           1
6         Andy Hunt           1

## Ejercicio 3: Precio medio por año de publicación
Calcular el precio medio de los libros por año (GROUP BY year).

In [12]:
# ✅ Solución
df_precio_por_anio = pd.read_sql("""
SELECT year, AVG(price) AS precio_medio
FROM books
GROUP BY year
ORDER BY year
""", engine)
df_precio_por_anio

   year  precio_medio
0  1997         19.99
1  1998         21.50
2  1999         31.50
3  2008         35.50
4  2009         22.50
5  2015         36.00
6  2017         25.00

## Ejercicio 4: Libros de género "Python"
Obtener los títulos de libros cuyo género sea Python (requiere JOIN entre books, books_genres y genres).

In [13]:
# ✅ Solución
df_python = pd.read_sql("""
SELECT b.title
FROM books b
JOIN books_genres bg ON b.id = bg.book_id
JOIN genres g ON bg.genre_id = g.id
WHERE g.name = 'Python'
""", engine)
df_python

              title
0     Fluent Python
1     Python Tricks
2  Effective Python

## Transacción con varios inserts y commit final

In [14]:
with Session(engine) as session:
    session.begin()
    session.execute(text("""
        INSERT INTO books (title, author_id, pages, year, price)
        VALUES ('Nuevo Libro 1', 1, 123, 2025, 15.00)
    """))
    session.execute(text("""
        INSERT INTO books (title, author_id, pages, year, price)
        VALUES ('Nuevo Libro 2', 2, 200, 2026, 18.00)
    """))
    session.commit()
print('✅ Insertados y guardados dos libros')

✅ Insertados y guardados dos libros

---
## Conclusiones
- **SQLAlchemy** simplifica las conexiones y permite transacciones explícitas.
- Usar **pandas** para traer resultados nos da ya el objeto DataFrame listo para análisis.
- Con consultas parametrizadas (`:param`) evitamos inyecciones SQL.
- La transacción con *rollback* es útil para tests o operaciones temporales.